# name = "l;uio;io;"
# name[2]
# print(name)

#
# st = ["Олеговна","Владимирович","Игоревна","Петрович"]
# for i in st:
#     if i[-3:] == "вна":
#         print(i)

# st = ["Олеговна","Владимирович","Игоревна","Петрович"]
# print("Игоревна" in st)
#
# st = [1,2,5,2,544,64,36]
# a = int(input())
# print(a in st and "есть" or "нет")


# st = ["апрп", "ололош", "дллолорп"]
# glas = "аеуыёоияюэ"
# for i in st:
#     if i[0] in glas:
#         print(i)

# Функция которая возврощает строку между begin и end


# def str_cut(st):
#     return st[st.find("begin")+5: st.find("end")]
# st = "vjselkfrjgheriugh begin ogijwortigjoj end gefgerg"
#
# print(str_cut(st))

# "Вытирайте ноги прежде чем заходите!"
# st = "Если сделал уроки и помыл посуду можешь идти гулять!"
# list = st.split(" ")
# st2 = " "
# print(list)
# for i in list:
#     if i!= " " and i[-1:] == "л":
#         i += "а"
#     st2 += i+" "
#
# print(st2, end=" ")

# Вывести все слова без повторений
# st = "апельсин мандарин апельсин тоже фрукт что и мандарин"
# list = st.split(" ")
# print((set(list)))

# st = "13213213213246543212"
# counter = 0
# for i in st:
#     if i.isdigit():
#         counter += 1
# print(counter, end= " ")







