# 1. Пользователь вводит имя и возраст, необходимо вывести информацию на консоль:
# name = int(input("Введите имя: "))
# age = int(input("Введите возраст: "))
# print(f"Имя - {name} . Возраст - {age} лет.")

# 2. Пользователь вводит 4 числа. Определить наибольшее и вывести на экран.
# a = int(input("Введите 1 число: "))
# b = int(input("Введите 2 число: "))
# c = int(input("Введите 3 число: "))
# d = int(input("Введите 4 число: "))
#
# if a>b and a>c and a>d:
#     print(f"Наибольшее число {a}")
# elif b<c and c>d:
#     print(f"Наибольшее число {c}")
# elif d > c:
#     print(f"Наибольшее число {d}")
# else:
#     print(f"Наибольшее число {b}")

# 3. Пользователь выбирает фигуру (квадрат  прямоугольник)

# sq = "квадрата"
# qc = "прямоугольника"
# figura = str(input("Выберите фигуру: "))
# if figura == "sq":
#     a = int(input("Введите сторону квадрата: "))
#     print(f"Площадь квадрата равна {a**2}")
# elif figura == "qc":
#     b = int(input("Введите 1 сторону прямоугольника: "))
#     c = int(input("Введите 2 сторону прямоугольника: "))
#     print(f"Площадь квадрата равна {b*c}")

# 4. Вывести все целые числа от а до b.
# a = int(input("Введите 1 число: "))
# b = int(input("Введите 2 число: "))
#
# for i in range(a, b, 1):
#     print(i)
#
# 5. Пользователь вводит числа пока не введет 0.
# После этого вывести сумму и произведение введенных чисел.

# sum = 0
# mult = 1
# a = int(input("Введите число: "))
# while a != 0:
#     sum += a
#     mult *= a
#     a = int(input("Введите число: "))
# print(sum)
# print(mult)


# 6. Вывести все числа кратные трем, в указанном диапозоне.
# В обратном порядке.

# a = int(input("Введите 1 число: "))
# b = int(input("Введите 2 число: "))
# for i in range(a, b, 1):
#     if i%3==0 and i>=a and i<=b:
#         i+=3
#
#     print(i)









# 7. Вывести всю таблицу умножения




# 8. Пользователь вводи N чисел.
# Найти наибольшее и наименьшее из введенных.

# n = int(input("Введите число: "))
# while n >= 1:
#     print(n)
#     n -= 1

